In [1]:
import pandas as pd
import numpy as np

from datetime import datetime

In [2]:
new_year = 2017
new_month = 1
new_day = 12
new_hour = 20
new_min = 25
new_sec = 40

In [3]:
new_date = datetime(new_year, new_month, new_day)

In [4]:
new_date

datetime.datetime(2017, 1, 12, 0, 0)

In [7]:
new_date_time = datetime(new_year, new_month, new_day, new_hour, new_min, new_sec)
new_date_time

datetime.datetime(2017, 1, 12, 20, 25, 40)

In [8]:
#Datetime variables are cognisant of the fact that they contains years, hours etc.

In [9]:
new_date_time.year

2017

In [10]:
new_series = pd.Series(['Sept 19, 1994', '2002-01-03', None])

In [11]:
new_series

0    Sept 19, 1994
1       2002-01-03
2             None
dtype: object

In [13]:
#Pandas understands these objects as strings, not yet Datetypes

In [16]:
time_series = pd.to_datetime(new_series)

In [15]:
#Now understood as Datetime - Year, Month, Day - US Style

In [17]:
time_series

0   1994-09-19
1   2002-01-03
2          NaT
dtype: datetime64[ns]

In [18]:
time_series[0].year

1994

In [20]:
#Understand Euro/ Aus Dates - Obvious Date as 31
aus_fortmat_date = '31-05-2021'

In [22]:
pd.to_datetime(aus_fortmat_date)

Timestamp('2021-05-31 00:00:00')

In [23]:
aus_date = '10-11-2021'

In [24]:
pd.to_datetime(aus_date, dayfirst=True)

Timestamp('2021-11-10 00:00:00')

In [25]:
#Understand differently formatted dates

In [26]:
style_date = '12--Oct--2002'

In [28]:
#Check official datetime documentation for formatting

pd.to_datetime(style_date, format='%d--%b--%Y')

Timestamp('2002-10-12 00:00:00')

In [31]:
#Understands a lot of different datetimes

custom_date = "12th of Dec 2008"

In [32]:
pd.to_datetime(custom_date)

Timestamp('2008-12-12 00:00:00')

In [33]:
#Read in a CSV file

In [42]:
sales = pd.read_csv("C:\\Users\\billy\\Desktop\\Python Finance\\03-Core-Pandas\\RetailSales_BeerWineLiquor.csv")

In [43]:
sales

           DATE  MRTSSM4453USN
0    1992-01-01           1509
1    1992-02-01           1541
2    1992-03-01           1597
3    1992-04-01           1675
4    1992-05-01           1822
..          ...            ...
335  2019-12-01           6630
336  2020-01-01           4388
337  2020-02-01           4533
338  2020-03-01           5562
339  2020-04-01           5207

[340 rows x 2 columns]

In [50]:
#Change from string to datetime - Only the datetime column, not entire series
sales['DATE'] = pd.to_datetime(sales['DATE'])

In [51]:
sales

          DATE  MRTSSM4453USN
0   1992-01-01           1509
1   1992-02-01           1541
2   1992-03-01           1597
3   1992-04-01           1675
4   1992-05-01           1822
..         ...            ...
335 2019-12-01           6630
336 2020-01-01           4388
337 2020-02-01           4533
338 2020-03-01           5562
339 2020-04-01           5207

[340 rows x 2 columns]

In [53]:
#Looks the same, but DATE is properly recognised
sales['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [55]:
sales['DATE'][6].year

1992

In [81]:
#Parse as dates via the index of the column instead

sales = pd.read_csv("C:\\Users\\billy\\Desktop\\Python Finance\\03-Core-Pandas\\RetailSales_BeerWineLiquor.csv", parse_dates=[0])

In [82]:
sales['DATE'].head()

0   1992-01-01
1   1992-02-01
2   1992-03-01
3   1992-04-01
4   1992-05-01
Name: DATE, dtype: datetime64[ns]

In [83]:
#Set date column to be index
sales = sales.set_index('DATE')

In [85]:
#Resample to group by the year
sales.resample(rule='A').mean()

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000

In [86]:
#Has dt method e.g
#sales['DATE'].dt.month